Autodesk.Navisworks.Api.ProgressBeginningEventArgs
Event arguments used for the Application::ProgressBeginning event

Autodesk.Navisworks.Api.ProgressBeginningEventArgs.Title
Gets the title of the overall operation that progress is being reported for. Displayed in
the title bar of the Navisworks progress dialog.